# JoistSystemNumberOfLinesParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..JoistSystemNumberOfLinesParam Property
ParameterTypeId Class See Also
---
"Number of Lines"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId JoistSystemNumberOfLinesParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JoistSystemNumberOfLinesParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ JoistSystemNumberOfLinesParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace